# BuiltInFailures.ComponentRepeaterFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ComponentRepeaterFailures Class
BuiltInFailures Class Members See Also
---
Failures related to component repeaters.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class ComponentRepeaterFailures
```

Visual Basic
---
```text
Public NotInheritable Class ComponentRepeaterFailures
```

Visual C++
---
```text
public ref class ComponentRepeaterFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..ComponentRepeaterFailures
# See Also
BuiltInFailures..::..ComponentRepeaterFailures Members
Autodesk.Revit.DB Namespace